---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexFormat.Dispose
source: html/f4049e6b-13cc-1cbe-a23d-79f7a5df28a4.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexFormat.Dispose Method

Releases all resources used by the VertexFormat

## Syntax (C#)
```csharp
public void Dispose()
```